"espk" = "gniazdo głośników Apple";
"ispk" = "Wbudowane";
"emic" = "gniazdo mikrofonu";
"imic" = "Wbudowane";
"hdpn" = "gniazdo słuchawek";
"lini" = "gniazdo wejścia liniowego audio";
"lino" = "gniazdo wyjścia liniowego audio";
"spdi" = "gniazdo cyfrowego wejścia optycznego";
"spdo" = "gniazdo cyfrowego wyjścia optycznego";
"pci " = "karta PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "urządzenie sieciowe";
"blue" = "Bluetooth";
"bluh" = "Słuchawki Bluetooth";
"blus" = "Zestaw słuchawkowy Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
